{
  "name": "Alex Beznos",
  "pageTitle": "Alex Beznos - Senior Software Developer",
  "title": "Senior Software Developer",
  "about": "My name is Alex Beznos and I am Ruby developer. I am passionate about technology and love to build stuff that matters. I like to build complex applications which makes people’s life easier, but at the same time keep code simple.",
  "contacts": {
    "phone": "+972536528844",
    "email": "beznosa@yahoo.com",
    "github_new": "github.com/AlexBeznoss",
    "github_old": "github.com/AlexBeznos",
    "linkedin": "linkedin.com/in/alex-beznos-255011a8"
  },
  "education": [
    {
      "title": "Master of Computer Science",
      "place": "National Aviation University",
      "from": "2013",
      "to": "2019"
    }
  ],
  "skills": [
    {
      "name": "Technical",
      "all": [
        "Ruby",
        "JS",
        "Golang",
        "Elixir",
        "Ruby On Rails",
        "Hanami",
        "PostgreSQL",
        "MySQL",
        "React"
      ]
    }
  ],
  "jobs": [
    {
      "company": "<a href=\"https://humanagency.com/\" target=\"_blank\">HumanAgency</a>",
      "role": "Senior Software Engineer",
      "from": "Nov 2018",
      "till": "Present",
      "description": "In my previous role as a key developer, I demonstrated my expertise in building complex SaaS platforms from scratch. Specifically, I was a key contributor to the development of <a href=\"https://formli.com\" target=\"_blank\">Formli</a>, an innovative engagement and data capturing platform that enables users to build customized forms and perform advanced data analysis easily. My contributions included designing and implementing several microservices using Golang and Elixir, as well as creating several gems and npm packages to enhance team productivity."
    },
    {
      "company": "<a href=\"https://www.roundforest.com/\" target=\"_blank\">Roundforest</a> feat <a href=\"http://sdsolutions.tech/\" target=\"_blank\">SD Solutions</a>",
      "role": "Team Lead",
      "from": "Sep 2017",
      "till": "Nov 2018",
      "description": "Initially, I was a key contributor to designing a sophisticated CMS and CRM system that utilized predictive analytics to suggest popular topics to writers creating articles for various content platforms. However, due to shifting priorities, I was later assigned to lead the development of another application that collected data from multiple hotel proposal providers, ranked it based on user needs, and presented it in a user-friendly interface. As the lead developer, I was responsible for managing the development team, overseeing the development process, and ensuring that all project milestones were met on time. "
    },
    {
      "company": "Enbro NV feat <a href=\"https://elixirator.com/\" target=\"_blank\">Elixirator</a>",
      "role": "Full Stack Ruby developer",
      "from": "Sep 2016",
      "till": "Aug 2017",
      "description": "We worked on CRM system for the creation, signing, and preparing contracts between gas/electricity companies and end customers. The main app was developed with Hanami on the backend and React on the frontend. As a part of development, we had to move logic from the legacy app(written on Ruby on Rails) to the new Hanami app."
    },
    {
      "company": "<a href=\"http://www.globallogic.com/ua\" target=\"_blank\">Global Logic</a>",
      "role": "Ruby on Rails developer",
      "from": "Jan 2015",
      "till": "Sep 2016",
      "description": "As a part of the team, I had to deliver an application that provides a user interface for building all sorts of interactive web advertisements. As a result, a user had to get four lines of JS code which had to be placed at any part of the web page and automatically expand when user visits this page. It was able to track customer interaction and show metrics to the ad creator."
    }
  ]
}
