{
  "name": "Alex Beznos",
  "pageTitle": "Alex Beznos - Senior Software Developer",
  "title": "Senior Software Developer",
  "about": "My name is Alex Beznos and I am Ruby developer. I am passionate about technology and love to build stuff that matters. I like to build complex applications which makes people’s life easier, but at the same time keep code simple.",
  "contacts": {
    "phone": "+972536528844",
    "email": "beznosa@yahoo.com",
    "github": "github.com/AlexBeznos",
    "linkedin": "linkedin.com/in/alex-beznos-255011a8"
  },
  "education": [
    {
      "title": "Master of Computer Science",
      "place": "National Aviation University",
      "from": "2017",
      "to": "2019"
    },
    {
      "title": "Bachelor of Computer Science",
      "place": "National Aviation University",
      "from": "2013",
      "to": "2017"
    }
  ],
  "skills": [
    {
      "name": "Technical",
      "all": [
        "Ruby",
        "JS",
        "Golang",
        "Elixir",
        "Ruby On Rails",
        "Hanami",
        "PostgreSQL",
        "MySQL",
        "React"
      ]
    }
  ],
  "jobs": [
    {
      "company": "<a href=\"https://humanagency.com/\" target=\"_blank\">HumanAgency</a>",
      "role": "Senior Ruby developer",
      "from": "Nov 2018",
      "till": "Oct 2022",
      "description": "As a key developer, I worked on building a SaaS platform from scratch. <a href=\"https://formli.app\" target=\"_blank\">Formli</a> is a engagement + data capturing platform which provides tools for building forms and data analysis. I participated in the development of all parts of the platform. Introduced a couple of microservices on Golang/Elixir and made a few gems and npm packages to improve the overall development experience."
    },
    {
      "company": "<a href=\"https://www.roundforest.com/\" target=\"_blank\">Roundforest</a> feat <a href=\"http://sdsolutions.tech/\" target=\"_blank\">SD Solutions</a>",
      "role": "Team Lead",
      "from": "Sep 2017",
      "till": "Nov 2018",
      "description": "I participated in the development of two apps. The first one was CMS, CRM system which had to predict popular topics and propose them to writers who had to create articles for different content platforms. But after some time priorities were changed and the whole team was moved to the creation of the app which had to collect data from different hotel proposal providers, rank it and show it to users depending on their needs. I was responsible for app development including team management, development process, and meeting deadlines."
    },
    {
      "company": "Enbro NV feat <a href=\"https://elixirator.com/\" target=\"_blank\">Elixirator</a>",
      "role": "Ruby developer",
      "from": "Sep 2016",
      "till": "Aug 2017",
      "description": "We worked on CRM system for the creation, signing, and preparing contracts between gas/electricity companies and end customers. The main app was developed with Hanami on the backend and React on the frontend. As a part of development, we had to move logic from the legacy app(written on Ruby on Rails) to the new Hanami app."
    },
    {
      "company": "<a href=\"http://www.globallogic.com/ua\" target=\"_blank\">Global Logic</a>",
      "role": "Ruby developer",
      "from": "Jan 2015",
      "till": "Sep 2016",
      "description": "As a part of the team, I had to deliver an application that provides a user interface for building all sorts of interactive web advertisements. As a result, a user had to get four lines of JS code which had to be placed at any part of the web page and automatically expand when user visits this page. It was able to track customer interaction and show metrics to the ad creator."
    }
  ]
}
